In [1]:
import pandas as pd

In [3]:
data=pd.read_csv("Placement_Data_Full_Class.csv")

In [4]:
data.head(1)

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.0,Others,91.0,Others,Commerce,58.0,Sci&Tech,No,55.0,Mkt&HR,58.8,Placed,270000.0

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [6]:
data.isna().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [7]:
data.fillna("not defined", inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_21932\886549535.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'not defined' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  data.fillna("not defined", inplace=True)

In [8]:
data.isna().sum()

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64

In [9]:
data.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

In [16]:
data=data.rename(columns={
    'sl_no': 'Serial Number', 
    'gender': 'Gender', 
    'ssc_p': 'SSC Percentage', 
    'hsc_p': 'HSC Percentage', 
    'degree_p': 'Degree Percentage', 
    'degree_t': 'Degree', 
    'workex': 'Work Experience', 
    'etest_p': 'E Test Percenatage', 
    'specialisation': 'Specialisation', 
    'mba_p': 'MBA Percentage',
    'status': 'Status', 
    'salary': 'Salary'
})

In [17]:
data.columns

Index(['Serial Number', 'Gender', 'SSC Percentage', 'ssc_b', 'HSC Percentage',
       'hsc_b', 'hsc_s', 'Degree Percentage', 'Degree', 'Work Experience',
       'E Test Percenatage', 'Specialisation', 'MBA Percentage', 'Status',
       'Salary'],
      dtype='object')

In [18]:
data.drop(columns=['ssc_b','hsc_b', 'hsc_s'],inplace=True)

In [19]:
data.columns

Index(['Serial Number', 'Gender', 'SSC Percentage', 'HSC Percentage',
       'Degree Percentage', 'Degree', 'Work Experience', 'E Test Percenatage',
       'Specialisation', 'MBA Percentage', 'Status', 'Salary'],
      dtype='object')

In [20]:
data.head(1)

,Serial Number,Gender,SSC Percentage,HSC Percentage,Degree Percentage,Degree,Work Experience,E Test Percenatage,Specialisation,MBA Percentage,Status,Salary
0,1,M,67.0,91.0,58.0,Sci&Tech,No,55.0,Mkt&HR,58.8,Placed,270000.0

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Serial Number       215 non-null    int64
 1   Gender              215 non-null    object
 2   SSC Percentage      215 non-null    float64
 3   HSC Percentage      215 non-null    float64
 4   Degree Percentage   215 non-null    float64
 5   Degree              215 non-null    object
 6   Work Experience     215 non-null    object
 7   E Test Percenatage  215 non-null    float64
 8   Specialisation      215 non-null    object
 9   MBA Percentage      215 non-null    float64
 10  Status              215 non-null    object
 11  Salary              215 non-null    object
dtypes: float64(5), int64(1), object(6)
memory usage: 20.3+ KB

In [22]:
data.to_csv("cleaned_placemant_data.csv",index=False)